CSI API ETABS v1
cTendonObj.GetLossesFixed Method
 Retrieves tendon loss data - fixed
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLossesFixed(
	string Name,
	ref int NumberItems,
	ref string[] TendonName,
	ref double[] StressingFixed,
	ref double[] LongTermFixed,
	eItemType ItemType = eItemType.Objects
)
Function GetLossesFixed (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef TendonName As String(),
	ByRef StressingFixed As Double(),
	ByRef LongTermFixed As Double(),
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cTendonObj
Dim Name As String
Dim NumberItems As Integer
Dim TendonName As String()
Dim StressingFixed As Double()
Dim LongTermFixed As Double()
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.GetLossesFixed(Name,
	NumberItems, TendonName, StressingFixed,
	LongTermFixed, ItemType)
int GetLossesFixed(
	String^ Name,
	int% NumberItems,
	array<String^>^% TendonName,
	array<double>^% StressingFixed,
	array<double>^% LongTermFixed,
	eItemType ItemType = eItemType::Objects
)
abstract GetLossesFixed :
        Name : string *
        NumberItems : int byref *
        TendonName : string[] byref *
        StressingFixed : float[] byref *
        LongTermFixed : float[] byref *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing tendon object or group, depending on the value of the ItemType item.
NumberItems
Type: System.Int32
 The total number of items retrieved for the specified tendon objects
TendonName
Type: System.String[]
 This is an array that includes the name of the tendon object associated with each value.
StressingFixed
Type: System.Double[]
 This is an array that includes the stressing losses [F/L2]
LongTermFixed
Type: System.Double[]
 This is an array that includes the long term losses [F/L2]
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, data is retrieved for the tendon object specified by the Name item.
 If this item is Group, data is retrieved for all tendon objects in the group specified by the Name item.
 If this item is SelectedObjects, data is retrieved for all selected tendon objects, and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the data is successfully retrieved; otherwise it returns a nonzero value.
See Also
Reference
cTendonObj Interface
ETABSv1 Namespace